Enums/ТипыОтветственныхЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыОтветственныхЛиц</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кладовщик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыОтветственныхЛиц/Ext/ManagerModule.bsl
#Область ОбработчикиСобытий

// Обработчик события "ОбработкаПолученияДанныхВыбора".
//
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтруктурнаяЕдиница = Неопределено;
	
	Если Параметры.Свойство("СтруктурнаяЕдиница",СтруктурнаяЕдиница) Тогда
		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений();
		ТипСтруктурнойЕдиницы = ТипЗнч(СтруктурнаяЕдиница);

		Если ТипСтруктурнойЕдиницы = Тип("СправочникСсылка.Склады") Тогда
			ДанныеВыбора.Добавить(Перечисления.ТипыОтветственныхЛиц.Кладовщик);
		ИначеЕсли ТипСтруктурнойЕдиницы = Тип("СправочникСсылка.Кассы") Тогда
			ДанныеВыбора.Добавить(Перечисления.ТипыОтветственныхЛиц.Кассир);
		ИначеЕсли ТипСтруктурнойЕдиницы = Тип("СправочникСсылка.Организации") Тогда
			
			ДанныеВыбора.Добавить(Перечисления.ТипыОтветственныхЛиц.Руководитель);
			ДанныеВыбора.Добавить(Перечисления.ТипыОтветственныхЛиц.ГлавныйБухгалтер);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ОбработкаПолученияДанныхВыбора()

#КонецОбласти
